README.md

# iniad-online-payments

## Build

```bash
mvn clean install
```

start the sprint boot

```bash
mvn spring-boot:run 
```

Port listening

```bash
8090
```

## Testing

### Local WSDL URL: 

http://localhost:8090/nexus/ws/OnlinePayment.wsdl

### curl for WSDL: 

```bash
curl --location --request GET 'http://localhost:8090/nexus/ws/OnlinePayment.wsdl'
```

### curl for Service Testing

```bash
curl --location --request POST 'http://localhost:8090/nexus/ws/OnlinePayment.wsdl' \
--header 'Content-Type: text/xml' \
--data '<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nex="http://www.ivlfin.org/OnlinePayment/">
    <soapenv:Header/>
    <soapenv:Body>
        <onl:OnlinePayment xmlns:onl="http://www.ivlfin.org/OnlinePayment/">
            <OnlinePaymentReq>
                <RRN>1310202100982823</RRN>
                <BANK_CODE>00019</BANK_CODE>
                <CARDNUMBER></CARDNUMBER>
                <LANACCOUNT>IDOFDEL02322027</LANACCOUNT>
                <CUSTID>0045048898</CUSTID>
                <ACTIVITYFLAG>U</ACTIVITYFLAG>
                <STATUSRRN>FINNONE</STATUSRRN>
                <AMOUNT>999</AMOUNT>
                <LASTPAYDATE>13102021</LASTPAYDATE>
                <TRANSNUMBER>2358422210</TRANSNUMBER>
                <REINSTATED>N</REINSTATED>
                <EMIAMOUNT>332</EMIAMOUNT>
            </OnlinePaymentReq>
        </onl:OnlinePayment>
    </soapenv:Body>
</soapenv:Envelope>'
```
